{
  "updated": "2025-06-07",
  "tasks": [
    {
      "id": "code-skyline-prewarm",
      "focus": "Code",
      "title": "Prewarm the skyline runner lane",
      "description": "Trim cold-starts by teaching Echo Computer to spin up a warm pool for back-to-back Python/Node chains.",
      "steps": [
        "Log every runner phase (queue, start, teardown) for a dual-language request and capture the gaps.",
        "Enable prewarming for the second language and rerun until the delta drops below 5s end-to-end.",
        "Save the before/after timings plus config toggles to `workspaces/demo/logs/runner-skyline.json`."
      ]
    },
    {
      "id": "create-celestial-overlay",
      "focus": "Create",
      "title": "Paint the celestial overlay palette",
      "description": "Draft a narrative overlay that surfaces palette, soundtrack, and intent without hiding the terminal.",
      "steps": [
        "Author `overlays/celestial.json` with gradient stops, soundtrack links, and on-success/failure copy.",
        "Prototype the overlay in HTML/CSS or ASCII art inside the workspace to feel the motion cues.",
        "Annotate how the overlay should react to latency spikes or test failures inside the mock file."
      ]
    },
    {
      "id": "collab-ground-station-kit",
      "focus": "Collaborate",
      "title": "Ship the ground-station handoff kit",
      "description": "Bundle commands, logs, and reviewer radar notes so another operator can resume the upgrade instantly.",
      "steps": [
        "List the critical files touched today plus `npm`/`python` commands to replay the run.",
        "Highlight at least two ideal reviewers with reasons (recent commits, subsystem familiarity, etc.).",
        "Publish the kit to `/handoff/kits/ground-station.json` and drop a link in the Echo feed."
      ]
    },
    {
      "id": "cloud-signal-trace",
      "focus": "Cloud",
      "title": "Trace the cloud signal lane",
      "description": "Validate Echo Computer's cloud endpoints and record latency/error budgets before the next rollout.",
      "steps": [
        "Ping each public endpoint and write latency + status into `cloud/healthcheck.json`.",
        "Tail the worker pods for 2–3 minutes to confirm no silent retries or throttling.",
        "Summarize regressions in the ops journal with links to the collected metrics."
      ]
    },
    {
      "id": "code-cache-drift-check",
      "focus": "Code",
      "title": "Check the cache drift lane",
      "description": "Benchmark cached vs. cold runs for the same project and document how to trigger safe invalidation.",
      "steps": [
        "Run a representative build twice and capture timing + cache hit/miss signals.",
        "Toggle a dependency version to confirm the cache invalidates and restores cleanly.",
        "Record the commands and deltas inside `workspaces/demo/logs/cache-drift.json`."
      ]
    },
    {
      "id": "collab-ops-journal",
      "focus": "Collaborate",
      "title": "Co-author today's ops journal",
      "description": "Pair with another operator to summarize risks, next steps, and key telemetry snippets from this session.",
      "steps": [
        "Capture two telemetry snippets (logs or metrics) with short captions and timestamps.",
        "Draft a mini handoff note with blockers, ready commands, and the reviewer you want feedback from first.",
        "Publish the journal entry to the shared feed or `/handoff/journal` endpoint for archival."
      ]
    }
  ]
}
