{
  "updated": "2025-05-18",
  "features": [
    {
      "id": "code-burst-link",
      "focus": "Code",
      "status": "Ready",
      "title": "Burst-link multi-runner",
      "description": "Queue Python and Node executions through a shared warm pool so chained runs feel instantaneous.",
      "impact": "Cuts polyglot feedback loops below five seconds for most scripts.",
      "blueprint": [
        "Add a runner toggle that pre-warms the next language container when the current run is >50% complete.",
        "Stream per-language stdout/stderr with timestamps so latency regressions are obvious.",
        "Persist merged logs plus timing metadata to `workspaces/<user>/logs/burst-link.json`."
      ]
    },
    {
      "id": "code-latency-map",
      "focus": "Code",
      "status": "Prototype",
      "title": "Latency map console",
      "description": "Expose a live console that visualises queue, start, and teardown timings for every sandbox run.",
      "impact": "Gives Echo instant awareness of runner pressure before launching the next upgrade.",
      "blueprint": [
        "Instrument the Node server with structured telemetry events emitted over WebSocket.",
        "Aggregate the events in the client and render sparkline charts beside the terminal.",
        "Add alert thresholds so spikes over 2× baseline get highlighted with recovery tips."
      ]
    },
    {
      "id": "create-luminary-deck",
      "focus": "Create",
      "status": "Prototype",
      "title": "Luminary overlay deck",
      "description": "Ship the narrative overlay cards that keep palette, soundtrack, and intent visible mid-run.",
      "impact": "Aligns creative direction with engineering execution during every sandbox session.",
      "blueprint": [
        "Expose a `/signals/luminary` endpoint returning the active overlay payload.",
        "Render collapsible cards beside the editor with keyboard shortcuts for focus mode.",
        "Allow saving overlay revisions with each workspace checkpoint for later playback."
      ]
    },
    {
      "id": "create-atlas-skyway",
      "focus": "Create",
      "status": "Research",
      "title": "Atlas skyway prompts",
      "description": "Map Echo Computer scenes to Echo Atlas beats via contextual prompt panels.",
      "impact": "Keeps writers, artists, and engineers synced on the same storyline arcs.",
      "blueprint": [
        "Ingest atlas metadata + pulse notes to build per-project context capsules.",
        "Design a dockable split-panel that can anchor on either side of the editor.",
        "Experiment with emoji-rich markdown syntax for mood and intent annotations."
      ]
    },
    {
      "id": "collab-ground-station",
      "focus": "Collaborate",
      "status": "Research",
      "title": "Reviewer ground-station",
      "description": "Surface who last touched each workspace file and auto-suggest handoff partners.",
      "impact": "Reduces async coordination time by highlighting ready reviewers plus runbooks.",
      "blueprint": [
        "Ingest the latest git commits for every workspace file and cache author metadata.",
        "Display avatars + reviewer suggestions beside the file tree with copy-to-clipboard run commands.",
        "Offer a `/handoff/ground-station` JSON feed for downstream notifications."
      ]
    },
    {
      "id": "collab-field-console",
      "focus": "Collaborate",
      "status": "Prototype",
      "title": "Collaboration field console",
      "description": "Bundle reviewer radar, telemetry snippets, and TODO prompts into a single shareable console view.",
      "impact": "Lets every operator publish a ready-to-run upgrade packet directly from Echo Computer.",
      "blueprint": [
        "Add a `/handoff/kits` endpoint that aggregates commits, test runs, and outstanding questions.",
        "Render a collapsible console with copy-to-clipboard runbooks and reviewer tags.",
        "Expose a webhook-friendly JSON payload for async channel broadcasts."
      ]
    }
  ]
}
