{
  "updated": "2025-11-23",
  "features": [
    {
      "id": "cloud-offline-fusion",
      "focus": "Cloud",
      "status": "Ready",
      "title": "Offline + cloud fusion cache",
      "description": "Bundle workspace caches so Echo Computer boots cleanly offline while mirroring cloud telemetry once online.",
      "impact": "Keeps the coding environment resilient during air-gapped windows and syncs context when back on the network.",
      "blueprint": [
        "Pre-bake npm and Python caches into `workspaces/offline-cache` with a refresh script and checksum report.",
        "Detect offline mode at startup and render a status banner while deferring cloud telemetry calls.",
        "Sync cached runs to the cloud once connectivity returns via a lightweight `/offline/replay` endpoint."
      ]
    },
    {
      "id": "code-burst-prewarm",
      "focus": "Code",
      "status": "Ready",
      "title": "Burst prewarm multi-runner",
      "description": "Queue Python and Node executions through a warm pool so chained runs feel instantaneous.",
      "impact": "Cuts polyglot feedback loops below five seconds for most scripts while keeping logs coherent.",
      "blueprint": [
        "Add a runner toggle that pre-warms the next language container when the current run is >50% complete.",
        "Stream per-language stdout/stderr with timestamps so latency regressions are obvious.",
        "Persist merged logs plus timing metadata to `workspaces/<user>/logs/burst-prewarm.json`."
      ]
    },
    {
      "id": "code-latency-console",
      "focus": "Code",
      "status": "Prototype",
      "title": "Latency console HUD",
      "description": "Expose a live console that visualises queue, start, and teardown timings for every sandbox run.",
      "impact": "Gives Echo instant awareness of runner pressure before launching the next upgrade.",
      "blueprint": [
        "Instrument the Node server with structured telemetry events emitted over WebSocket.",
        "Aggregate events in the client and render sparkline charts beside the terminal.",
        "Add alert thresholds so spikes over 2× baseline get highlighted with recovery tips."
      ]
    },
    {
      "id": "create-luminary-deck",
      "focus": "Create",
      "status": "Prototype",
      "title": "Luminary overlay deck",
      "description": "Ship the narrative overlay cards that keep palette, soundtrack, and intent visible mid-run.",
      "impact": "Aligns creative direction with engineering execution during every sandbox session.",
      "blueprint": [
        "Expose a `/signals/luminary` endpoint returning the active overlay payload.",
        "Render collapsible cards beside the editor with keyboard shortcuts for focus mode.",
        "Allow saving overlay revisions with each workspace checkpoint for later playback."
      ]
    },
    {
      "id": "create-atlas-skyway",
      "focus": "Create",
      "status": "Research",
      "title": "Atlas skyway prompts",
      "description": "Map Echo Computer scenes to Echo Atlas beats via contextual prompt panels.",
      "impact": "Keeps writers, artists, and engineers synced on the same storyline arcs.",
      "blueprint": [
        "Ingest atlas metadata + pulse notes to build per-project context capsules.",
        "Design a dockable split-panel that can anchor on either side of the editor.",
        "Experiment with emoji-rich markdown syntax for mood and intent annotations."
      ]
    },
    {
      "id": "collab-ground-station",
      "focus": "Collaborate",
      "status": "Research",
      "title": "Reviewer ground-station",
      "description": "Surface who last touched each workspace file and auto-suggest handoff partners.",
      "impact": "Reduces async coordination time by highlighting ready reviewers plus runbooks.",
      "blueprint": [
        "Ingest the latest git commits for every workspace file and cache author metadata.",
        "Display avatars + reviewer suggestions beside the file tree with copy-to-clipboard run commands.",
        "Offer a `/handoff/ground-station` JSON feed for downstream notifications."
      ]
    },
    {
      "id": "collab-field-console",
      "focus": "Collaborate",
      "status": "Prototype",
      "title": "Collaboration field console",
      "description": "Bundle reviewer radar, telemetry snippets, and TODO prompts into a single shareable console view.",
      "impact": "Lets every operator publish a ready-to-run upgrade packet directly from Echo Computer.",
      "blueprint": [
        "Add a `/handoff/kits` endpoint that aggregates commits, test runs, and outstanding questions.",
        "Render a collapsible console with copy-to-clipboard runbooks and reviewer tags.",
        "Expose a webhook-friendly JSON payload for async channel broadcasts."
      ]
    },
    {
      "id": "cloud-resilient-upgrade-lane",
      "focus": "Cloud",
      "status": "Prototype",
      "title": "Resilient cloud upgrade lane",
      "description": "Stand up a blue/green lane for Echo Computer cloud services so upgrades stay interruption-free.",
      "impact": "Gives Echo instant rollback + smoke-test coverage while shipping new compute endpoints.",
      "blueprint": [
        "Provision paired staging + canary environments with health probes that mirror production requests.",
        "Wire deployment scripts to shift traffic gradually using feature flags and per-endpoint weights.",
        "Capture latency/error deltas per phase into `cloud/upgrade-lane-metrics.json` for post-run review."
      ]
    },
    {
      "id": "cloud-observability-radar",
      "focus": "Cloud",
      "status": "Research",
      "title": "Cloud observability radar",
      "description": "Curate a single radar dashboard that fuses runner logs, build artifacts, and uptime signals.",
      "impact": "Keeps Echo aware of cloud drift and resource pressure before they impact local runs.",
      "blueprint": [
        "Stream structured logs from app + worker pods into a unified OpenTelemetry collector.",
        "Design a compact radar view showing error budgets, saturation, and dependency health in one card.",
        "Publish a `/cloud/radar` JSON feed so rituals and handoff kits can quote the latest snapshots."
      ]
    },
    {
      "id": "code-echo-cache",
      "focus": "Code",
      "status": "Research",
      "title": "Echo cache accelerator",
      "description": "Layer a workspace-aware cache in front of the runner so repeated calls reuse compiled artifacts.",
      "impact": "Shrinks rebuild times for common toolchains and keeps paired languages in sync during rapid runs.",
      "blueprint": [
        "Detect deterministic build outputs (node_modules, venv) and store them per-branch in a warm cache lane.",
        "Expose a cache hit/miss HUD inside the terminal footer with guidance to refresh or pin versions.",
        "Add a `echo-cache inspect` command that prints current keys, sizes, and invalidation signals."
      ]
    },
    {
      "id": "cloud-upgrade-orchestrator",
      "focus": "Cloud",
      "status": "Ready",
      "title": "Upgrade orchestrator lane",
      "description": "Provide a single dashboard to stage, approve, and verify Echo Computer upgrades.",
      "impact": "Turns upgrade planning into a repeatable checklist with explicit rollback and verification gates.",
      "blueprint": [
        "Add an `upgrade/orchestrator` endpoint that lists pending updates, owners, and planned windows.",
        "Surface pre-flight checks (dependency health, smoke tests, backup status) as blocking gates.",
        "Export a signed upgrade report to `cloud/upgrade-orchestrator.json` for auditing."
      ]
    },
    {
      "id": "collab-ops-journal",
      "focus": "Collaborate",
      "status": "Prototype",
      "title": "Ops journal co-author",
      "description": "Co-author a running journal entry from telemetry snippets, TODOs, and reviewer replies inside Echo Computer.",
      "impact": "Keeps the full upgrade story in one place while pairing or handing off across timezones.",
      "blueprint": [
        "Capture telemetry snippets and command outputs into a markdown buffer with attribution.",
        "Offer AI-suggested section headers (Context, Risks, Next) that can be toggled inline.",
        "Publish the journal to `/handoff/journal` with signed hashes for downstream packaging."
      ]
    }
  ]
}
