{
  "updated": "2025-05-11",
  "features": [
    {
      "id": "code-multi-runner",
      "focus": "Code",
      "status": "Ready",
      "title": "Modular multi-language runner",
      "description": "Chain Python and Node executions so Echo can prove new features across stacks from a single request.",
      "impact": "Cuts the feedback loop for polyglot experiments to minutes.",
      "blueprint": [
        "Add a client toggle that queues multiple run targets in order.",
        "Stream combined stdout/stderr with language labels for each phase.",
        "Persist the merged log to the workspace for pairing review."
      ]
    },
    {
      "id": "code-flight-recorder",
      "focus": "Code",
      "status": "Prototype",
      "title": "Runner flight recorder",
      "description": "Capture per-run telemetry (queue time, container start, teardown) and expose it beside the terminal.",
      "impact": "Gives Echo immediate visibility into slow paths so upgrades can be targeted within the same session.",
      "blueprint": [
        "Instrument the Node server to emit structured timing events for each sandbox lifecycle stage.",
        "Persist the most recent N runs in a lightweight log file within the workspace.",
        "Add a frontend timeline panel that highlights spikes and links directly to run output."
      ]
    },
    {
      "id": "create-signal-deck",
      "focus": "Create",
      "status": "Prototype",
      "title": "Signal deck overlays",
      "description": "Design lightweight overlay cards that summarize story, palette, and sound cues above the editor.",
      "impact": "Keeps creative direction visible while implementing the feature.",
      "blueprint": [
        "Expose a `/signals/now` endpoint that returns the latest deck payload.",
        "Render collapsible cards near the terminal with keyboard shortcuts.",
        "Allow saving the deck with each workspace checkpoint."
      ]
    },
    {
      "id": "create-atlas-panels",
      "focus": "Create",
      "status": "Research",
      "title": "Atlas prompt panels",
      "description": "Layer contextual prompt panels that map Echo Computer scenes to the broader Echo Atlas storyline.",
      "impact": "Connects daily sandbox work to the studio-wide narrative arcs and keeps writers in sync with engineers.",
      "blueprint": [
        "Ingest pulse + atlas metadata to assemble per-project story beats.",
        "Design a split-panel layout that can dock on either side of the editor.",
        "Experiment with markdown + emoji syntax for quickly annotating mood and goals."
      ]
    },
    {
      "id": "collab-radar",
      "focus": "Collaborate",
      "status": "Research",
      "title": "Collaboration radar",
      "description": "Surface who last touched a file plus suggested reviewers to accelerate feature handoffs.",
      "impact": "Reduces time to handoff by highlighting ready partners.",
      "blueprint": [
        "Ingest recent Git commits per workspace file.",
        "Display avatars and suggested reviewers beside the file tree.",
        "Offer one-click share links that copy run instructions."
      ]
    },
    {
      "id": "collab-field-console",
      "focus": "Collaborate",
      "status": "Prototype",
      "title": "Collaboration field console",
      "description": "Bundle reviewer radar, run instructions, and async notes into a single console view inside Echo Computer.",
      "impact": "Gives every operator a ready-to-share upgrade packet without leaving the sandbox.",
      "blueprint": [
        "Add a `/handoff/kits` endpoint that aggregates latest commits, test runs, and TODOs.",
        "Render a collapsible console with copy-to-clipboard runbooks and reviewer suggestions.",
        "Expose a webhook-friendly JSON payload for downstream notifications."
      ]
    }
  ]
}
