{
  "updated": "2025-05-21",
  "rituals": [
    {
      "id": "code-flight-recorder",
      "focus": "Code",
      "title": "Launch the sandbox flight recorder",
      "cadence": "weekly",
      "description": "Dedicate a deep session to harden the timing instrumentation that keeps the runner honest under load.",
      "steps": [
        "Trace at least three full executions (Python, Node, dual-run) and record queue/start/teardown timing.",
        "Add structured telemetry to the Node stream so every run emits latency + resource hints automatically.",
        "Export the latest capture into `workspaces/demo/logs/flight-recorder.json` for the changelog."
      ],
      "tags": ["advance", "upgrade", "optimize"]
    },
    {
      "id": "creative-beacon-grid",
      "focus": "Create",
      "title": "Weave the luminary beacon grid",
      "cadence": "weekly",
      "description": "Iterate on the narrative overlay system that keeps palette, soundtrack, and intent visible in the editor.",
      "steps": [
        "Storyboard at least two overlay states (calm + launch) including typography, gradients, and motion.",
        "Prototype the transitions in CSS variables or shader-like pseudo code inside the workspace.",
        "Publish a GIF/screenshot or markdown walkthrough linked from the ritual log."
      ],
      "tags": ["create", "advance"]
    },
    {
      "id": "collab-ground-station",
      "focus": "Collaborate",
      "title": "Activate the reviewer ground-station",
      "cadence": "weekly",
      "description": "Pair with another operator to stress-test reviewer radar flows and leave a ready-to-run handoff kit.",
      "steps": [
        "Enumerate the last five commits for the feature files and label likely reviewers.",
        "Bundle run instructions, telemetry screenshots, and TODO prompts into a single console note.",
        "Schedule an async check-in and capture any new questions or blockers in the ritual archive."
      ],
      "tags": ["advance", "upgrade", "optimize"]
    },
    {
      "id": "cloud-skyway-upgrade",
      "focus": "Cloud",
      "title": "Rehearse the cloud skyway upgrade",
      "cadence": "weekly",
      "description": "Dry-run the blue/green rollout for Echo Computer cloud services with telemetry stitched into the ritual log.",
      "steps": [
        "Spin up the canary environment and smoke-test the public endpoints with synthetic workload traces.",
        "Shift 10-20% traffic through the canary using weighted routing or feature flags while watching error budgets.",
        "Record rollback/rollback-ready commands plus metrics snapshots into the ritual journal for reuse."
      ],
      "tags": ["upgrade", "optimize", "cloud"]
    }
  ]
}
