{
  "updated": "2025-11-23",
  "rituals": [
    {
      "id": "code-orbit-recorder",
      "focus": "Code",
      "title": "Harden the orbit flight recorder",
      "cadence": "weekly",
      "description": "Dedicate a deep session to tighten runner telemetry so Echo can prove performance before each upgrade.",
      "steps": [
        "Trace three full executions (Python, Node, chained) and log queue/start/teardown timings.",
        "Expose structured events on the WebSocket stream with per-phase latency + resource hints.",
        "Export the latest capture to `workspaces/demo/logs/orbit-flight-recorder.json` for the changelog."
      ],
      "tags": ["advance", "upgrade", "optimize"]
    },
    {
      "id": "creative-luminary-grid",
      "focus": "Create",
      "title": "Evolve the luminary beacon grid",
      "cadence": "weekly",
      "description": "Iterate on the overlay system that keeps palette, soundtrack, and intent visible in the editor.",
      "steps": [
        "Storyboard at least two overlay states (calm + launch) with typography, gradients, and motion.",
        "Prototype transitions with CSS variables or shader-like pseudo code inside the workspace.",
        "Publish a GIF/screenshot or markdown walkthrough linked from the ritual log."
      ],
      "tags": ["create", "advance"]
    },
    {
      "id": "collab-reviewer-radar",
      "focus": "Collaborate",
      "title": "Activate the reviewer radar",
      "cadence": "weekly",
      "description": "Pair with another operator to stress-test reviewer discovery and leave a ready-to-run handoff kit.",
      "steps": [
        "Enumerate the last five commits for the feature files and label likely reviewers.",
        "Bundle run instructions, telemetry screenshots, and TODO prompts into a single console note.",
        "Schedule an async check-in and capture any new questions or blockers in the ritual archive."
      ],
      "tags": ["advance", "upgrade", "optimize"]
    },
    {
      "id": "cloud-skyway-rehearsal",
      "focus": "Cloud",
      "title": "Rehearse the skyway upgrade lane",
      "cadence": "weekly",
      "description": "Dry-run the blue/green rollout for Echo Computer cloud services with telemetry stitched into the ritual log.",
      "steps": [
        "Spin up the canary environment and smoke-test public endpoints with synthetic workload traces.",
        "Shift 10–20% traffic through the canary using weighted routing or feature flags while watching error budgets.",
        "Record rollback-ready commands plus metrics snapshots into the ritual journal for reuse."
      ],
      "tags": ["upgrade", "optimize", "cloud"]
    },
    {
      "id": "code-cache-corridor",
      "focus": "Code",
      "title": "Stabilise the cache corridor",
      "cadence": "weekly",
      "description": "Validate cache hit rates across three workspaces and decide which keys should be pinned or rotated.",
      "steps": [
        "Run a triad of workloads (Node, Python, mixed) and capture cache metrics for each.",
        "Simulate a cache bust by changing dependencies, then measure recovery and rebuild times.",
        "Publish guidance on default TTLs and manual overrides to the ritual archive."
      ],
      "tags": ["upgrade", "optimize", "code"]
    },
    {
      "id": "cloud-upgrade-refresh",
      "focus": "Cloud",
      "title": "Refresh the upgrade & patch cadence",
      "cadence": "weekly",
      "description": "Review cloud dependencies and document the next patch window for Echo Computer.",
      "steps": [
        "Audit the deployed services and note any pending security or runtime updates.",
        "Schedule a patch window with a rollback plan and add it to the ops calendar.",
        "Publish the upgrade notes and checkpoints to the ritual archive."
      ],
      "tags": ["upgrade", "advance", "cloud"]
    },
    {
      "id": "collab-ops-journal",
      "focus": "Collaborate",
      "title": "Publish the ops journal bundle",
      "cadence": "weekly",
      "description": "Ship a polished weekly ops journal that stitches together telemetry, reviewer notes, and next steps.",
      "steps": [
        "Aggregate the week's telemetry snippets and tag each with affected services.",
        "Invite a reviewer to co-author the risk/decision log and capture their responses inline.",
        "Export the bundle to `/handoff/journal` with hashes so downstream consumers can verify integrity."
      ],
      "tags": ["advance", "optimize", "collaborate"]
    }
  ]
}
